archive/before-2018-11-10/2018-07-31-使用mutex互斥量和条件变量对线程进行同步的例子.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2018-07-31-使用mutex互斥量和条件变量对线程进行同步的例子</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2018-07-31-使用mutex互斥量和条件变量对线程进行同步的例子</h1>
<p>
两个线程之前使用互斥量和条件变量进行同步。C代码如下：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;string.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;pthread.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;sys/types.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;unistd.h&gt;</span>

<span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">&#20114;&#26021;&#37327; </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
<span style="color: #00d7af;">pthread_mutex_t</span> <span style="color: #ff8700;">qlock</span> = PTHREAD_MUTEX_INITIALIZER;
<span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">&#26465;&#20214;&#21464;&#37327; </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
<span style="color: #00d7af;">pthread_cond_t</span> <span style="color: #ff8700;">qready</span> = PTHREAD_COND_INITIALIZER;

<span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">&#20020;&#30028;&#36164;&#28304;&#65292;&#20004;&#20010;&#32447;&#31243;&#37117;&#20250;&#35775;&#38382; </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">value</span> = 0;

<span style="color: #00d7af;">void</span> * <span style="color: #ffd700;">thread2</span>(<span style="color: #00d7af;">void</span> *<span style="color: #ff8700;">arg</span>)
{
    <span style="color: #a1db00;">while</span> (1)
    {
        pthread_mutex_lock(&amp;qlock);

        <span style="color: #a1db00;">while</span>(<span style="color: #ff4b4b;">!</span>value)
        {
            <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">&#25105;&#29702;&#35299;&#65306;thread2&#22312;&#36825;&#37324;&#31561;&#30340;&#26102;&#20505;&#65292;&#20250;&#23545;&#20114;&#26021;qlock&#36827;&#34892;&#35299;&#38145;&#12290;&#34987;</span>
<span style="color: #6c6c6c; font-style: italic;">             * thread1&#30340;signal&#21796;&#37266;&#21518;&#65292;&#23427;&#21448;&#20250;&#25226;&#20114;&#26021;&#37327;qlock&#38145;&#20303; </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
            pthread_cond_wait(&amp;qready, &amp;qlock);
        } 

        printf(<span style="color: #ff4ea3;">"in thread 2: value = %d\n"</span>, value);
        
        value = 0;
        
        sleep(1);

        pthread_mutex_unlock(&amp;qlock);
    }

    <span style="color: #a1db00;">return</span> <span style="color: #5fafd7;">NULL</span>;
}

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    printf(<span style="color: #ff4ea3;">"Test for mutex and conf: \n"</span>);
    
    <span style="color: #00d7af;">pthread_t</span> <span style="color: #ff8700;">tid</span>;
    <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">i</span> = 1;

    <span style="color: #a1db00;">while</span>(1)
    {
        pthread_create(&amp;tid, <span style="color: #5fafd7;">NULL</span>, &amp;thread2, <span style="color: #5fafd7;">NULL</span>);

        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">thread2&#34987;&#21796;&#37266;&#27491;&#22312;&#36827;&#34892;&#22788;&#29702;&#65292;&#26102;&#65292;&#22914;&#26524;&#27491;&#22312;&#35775;&#38382;&#20020;&#30028;&#36164;&#28304;&#65292;&#36825;&#37324;&#23601;</span>
<span style="color: #6c6c6c; font-style: italic;">         * &#26159;value&#12290;&#37027;&#35813;&#32447;&#31243;&#20250;&#22312;&#36825;&#37324;&#31561;&#24453;&#12290; </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
        pthread_mutex_lock(&amp;qlock);
        
        value = i;

        pthread_mutex_unlock(&amp;qlock);

        printf(<span style="color: #ff4ea3;">"[%s:%d] main thread send signal %d\n"</span>, __FUNCTION__, __LINE__, value);

        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">&#36825;&#37324;&#23601;&#26159;&#36890;&#36807;&#26465;&#20214;&#21464;&#37327;&#25226;thread2&#21796;&#37266; </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
        pthread_cond_signal(&amp;qready);
        
        <span style="color: #a1db00;">if</span> (i == 2)
        {
            <span style="color: #a1db00;">break</span>;
        }
        
        i++;
    }

    sleep(5);

    <span style="color: #a1db00;">return</span> 0;
}

</pre>
</div>

<p>
Makefile如下：
</p>
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #ffd700;">.PHONY</span>:a.out
<span style="color: #ffd700;">a.out</span>:
        cc main.c -lpthread
<span style="color: #ffd700;">clean</span>:
        rm -rfv *~ a.out
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>